package site.blmdz.mobile.enums;

import lombok.Getter;
import lombok.Setter;

public enum AppError {
	
	/**
	 * 执行成功
	 */
	A00000("000000","执行成功"),
	
	/**
	 * 尚未登录
	 */
	A00999("A00999","登录超时，请重新登录"),
	
	//非业务报错
	/**
	 * 请求读取失败
	 */
	A01000("A01000","请求读取失败"),
	/**
	 * 请求报文为空
	 */
	A01001("A01001","请求报文为空"),
	/**
	 * 请求报文验证sign失败
	 */
	A01002("A01002","请求报文验证sign失败"),
	/**
	 * 请求报文转换失败
	 */
	A01003("A01003","请求报文转换失败"),
	/**
	 * 请求报文校验失败
	 */
	A01004("A01004","服务暂不可用，请稍后再试"),
	/**
	 * 请求报文校验报错
	 */
	A01005("A01005","请求报文校验报错"),
	
	/**
	 * 执行错误
	 */
	/**
	 * 数据转换报错
	 */
	A02000("A02000","数据转换报错"),
	/**
	 * 生成操作流水号出错
	 */
	A02001("A02001","生成操作流水号出错"),
	/**
	 * 校验条形码报错
	 */
	A02002("A02002","校验条形码报错"),
	/**
	 * 调用业务网关接口报错
	 */
	A02003("A02003","调用业务网关接口报错"),
	/**
	 * 查询业务字典失败
	 */
	A02004("A02004","查询业务字典失败"),
	/**
	 * 业务状态不正确
	 */
	A02005("A02005","业务状态不正确"),
	
	/**
	 * 数据转换报错
	 */
	A03100("A03100","数据转换报错"),
	/**
	 * 调用超时
	 */
	A04100("A04100","调用超时"),
	
	/**
	 * 红包的最小值不正确
	 */
	A05100("A05100","红包的最小值不正确"),

	/**
	 * 红包的最大值不正确
	 */
	A05102("A05102","红包的最大值不正确"),
	
	/**
	 * 红包发放部分成功
	 */
	A05101("A05101","红包发放部分成功"),
	/**
	 * 亲，红包太小，拿不出手
	 */
	A05103("A05103","亲，红包太小，拿不出手"),
	/**
	 * 部分用户暂时无法接收红包，请至“我发的红包”页面查看
	 */
	A05104("A05104","部分用户暂时无法接收红包，请至“我发的红包”页面查看"),
	/**
	 * 对方用户暂时无法接收红包，请稍后再试
	 */
	A05105("A05105","对方用户暂时无法接收红包，请稍后再试"),
	
	/**
	 * 不支持的转账类型
	 */
	A06000("A06000","不支持的转账类型"),
	/**
	 * 不支持的支付类型
	 */
	A06001("A06001","不支持的支付类型"),
	
	/**
	 * 申请序列号不能为空
	 */
	A06002("A06002","申请序列号不能为空"),
	/**
	 * 交易时间不能为空
	 */
	A06003("A06003","交易时间不能为空"),
	/**
	 * 交易流水号不能为空
	 */
	A06004("A06004","交易流水号不能为空"),
	/**
	 * 水电煤缴费失败
	 */
	A06005("A06005","水电煤缴费失败"),
	
	/**
	 * 对不起，您输入的卡号有误，请重新输入
	 */
	A06006("A06006","对不起，您输入的卡号有误，请重新输入"),
	
	/**
	 * 动态码不能为空
	 */
	A06007("A06007","动态码不能为空"),
	/**
	 * 手机充值超时，请以账单通知为准
	 */
	A07001("A07001","手机充值超时，请以账单通知为准"),
	/**
	 * 手机充值通知状态不正确
	 */
	A07002("A07002","手机充值通知状态不正确"),

	/**
	 * 验证失败
	 */
	A09000("A09000","验证失败"),
	
	
	/**
	 * 报文验证码校验不正确
	 */
	A09010("A09010","报文验证码校验不正确"),
	/**
	 * 报文头不正确
	 */
	A09011("A09011","报文头不正确"),
	/**
	 * 异常失败
	 */
	A09999("A09999","异常失败")
	;

	@Setter
	@Getter
	private String code;
	
	@Setter
	@Getter
	private String message;
	
	AppError(String code, String message){
		this.code= code;
		this.message=message;
	}
	
	public static String parse(String code){
		if(code == null || code.trim().length()== 0){
			return null;
		}
		
		for(AppError appError : AppError.values()){
			if(appError.getCode().equals(code)){
				return appError.getMessage();
			}
		}
		return null;
	}
	
	
	
}
